

// <!-- jQueryで抽選プログラム -->

// <!-- mindfulness 0000 受け止める
// Resolution 0100 覚悟する
// Quest 0001 求める
// Challenge 0101 立ち向かう
// Begin 1000 始める
// Passion 1100 やってみる
// Curiosity 1001 交わる
// Adventure 1101 踏み出す
// Trust 0010 信頼する
// Update 0110 教わる
// Diversity 0011　心を開く
// Synergy 0111 感謝する
// Relationship 1010 結束する
// Partnership 1110　協調する
// Inclusion 1011 対等になる
// Resonance 1111　協創する -->

// 背景色変えhttps://deshinon.com/2019/03/06/background-oshare-kopipe/
// タブ３つhttps://bagelee.com/design/css/create_tabs_using_only_css/

// $(function(){

//   $('.stop').hide();
//   $('.start').click(function(){
//   $(this).hide(); 
//   $('.stop').show(); 
// });

$('.start').click(function(){
      $(this).hide(); 
      $('.rand_name').show();
      $('.stop').show();
     console.log(this);
    }
  );


$(function(){
    //候補を配列で設定
   

    var aryList = ['mindfulness 受け止める','Resolution 覚悟する','Quest 求める','Challenge 立ち向かう','Begin 始める','Passion やってみる','Curiosity 交わる','Adventure 踏み出す','Trust 信頼する','Update 教わる','Diversity 心を開く','Synergy 感謝する','Relationship 結束する','Partnership 協調する','Inclusion 対等になる','Resonance 協創する',];
 
    
    //グローバル変数
    var key = 0;
    var max_len = aryList.length ;
    var randStart;
    var speed = 20; //シャッフルスピード
    
    //文字シャッフル関数
    //20ミリ秒毎に候補の文字列をシャッフルさせる
    var randShuffle= function(){
        if(key > max_len) key = 0 - 1;
        $('.rand_name').text(aryList[key]);
        key++;
    }
    //文字シャッフル開始
    randStart = setInterval(randShuffle, speed);

    $('.rand_name').hide();
    $('.stop').hide();

    
    
    //回転を止める（抽選結果）
   

      $('.stop').click(function(){
          var random = Math.floor(Math.random() * (max_len + 1)); //ランダムで配列の数を取得
          $('.rand_name').text(aryList[random]).hide().fadeIn(2000); //対象の数値に該当する文字を表示
          console.log(random)
          clearInterval(randStart); //シャッフルストップ
          $(this).hide(); //止めるボタンの非表示
          $('.restart').show(); //再開ボタンの表示
        

          if (aryList[random] === 'mindfulness 受け止める') {
            
            $('.change_result1').text("<素直にやるべきことを実行する>").hide().fadeIn(5000).show();
            $('.change_result2').text("やるべき仕事に追われて、時間もない。ところが問題が見えてきている。それなのに、状況分析もできない。先の見えない不安や迷いが生じる。このような状況にどう向き合えばよいのだろうか。これを「受け止める(Mindfulness)」大事なことは、置かれている環境や境遇をまずは、ありのままに受け入れ、やるべきことを着実に実行することである。まずはやるべきことを素直に実行してこそ、その先がある。現実は急には変わらない。 そして現実が今そこにあるのには理由がある。だから我々は現実を謙虚に受け入れなければならない。すなわち、この「受け止める」とは、現実を謙虚に認め、人のせいにせず、素直にやるべきことを実行することである。").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");
            
          } else if (aryList[random] === 'Resolution 覚悟する'){
          
            $('.change_result1').text("<矛盾を引き受けることを覚悟する>").hide().fadeIn(5000).show();
            $('.change_result2').text("現実には、矛盾や対立が必ず存在する。予測不能な変化の下では、この矛盾や対立がさらに顕在化する。短期の成果を大事にするか、それとも長期の成果を大事にするか。短期がうまくいかなければ長期はないので、短期は大事だ。しかし、一方で、長期の目的や存在意義がおろそかになっては、短期の意味もない。このような対立があらゆるところに表れる。これらの矛盾・対立はあなたの内面を落ち着かなくさせる。ありのままで、矛盾し対立するう現実を受け入れる覚悟を持つのである。これを「覚悟する(Resolution)」と呼ぼう。ここで対立する一方を犯人や悪者にするのは、安易な答えである。このような安易さを避ける覚悟により、矛盾を越えた新たな視点へとつながっていく。「覚悟する」とは、矛盾を引き受け、そのための行動をいとわない覚悟をもつことである。").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");
            

          } else if (aryList[random] === 'Quest 求める'){
        
            $('.change_result1').text("<先走らず、今の一歩に集中する>").hide().fadeIn(5000).show();
            $('.change_result2').text("新たなことを求めて前に進むことが必要なときがある。慣れない状況で、先行きも見通せない。これを「求める(Quest)」と呼ぶ。現実は常に複雑である。しかし、この先の見えない状況でも、立ち止まっていけない。常に前向きに大きな目的を追求するうことが大事である。そのためには、先が見えなくとも、不安を超えて今の一歩に集中することである。すなわち、この「求める」とは、先が見えなくとも今の一歩に集中することである。どんな状況でも、迷わずにこの境地にいたれば、それは動的な意味で「幸せ」である。").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Challenge 立ち向かう'){
            
            $('.change_result1').text("困難には立ち向かい、今日を最高の学びの日にする").hide().fadeIn(5000).show();
            $('.change_result2').text("先の見えない状況に、行動を起こせば、思うようにはいかない。どうすればうまくいくか見通しもない困難に苦しむことになる。このときにどうするか。これを「立ち向かう(Challenge)」と呼ぼう。仕事も人生も、山あり谷ありである。困難や試練が降りかかってくることは、何人も避けられない。このときこそが大事である。この日こそが最高の学びの機会だからである。あなたは、このような困難や試練を、最高の学びの機会に使えるだろうか。実際、そのような状況でなければ体験できないことは多い。まさに貴重な機会を得ているのである。これを使わない手はない。この日に潜む機会を汲みあげられるかが試されているのである。常に状況は複雑である。表面を見れば混沌としていることも多い。しかし、この混沌に立ち向かい、この混沌から知恵を導けるだろうか。すなわち、この「立ち向かう」とは、困難に果敢に立ち向かうことで、これを最高の学びの機会に変え、そこに潜む新たな機会を汲み上げることである。").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Begin 始める'){
        
            $('.change_result1').text("<次のステージに向け、最初の一文字を書き始める>").hide().fadeIn(5000).show();
            $('.change_result2').text("新しいことを前にして、先が見えない。ここでどうするか。それが「始める(Begin)」である。ことが新しい段階に進んだときや状況変化があったときは、道もなく地図もコンパスもなく、正しい方向も道もわからない。だからこそ、ともかく始めることが大事なのである。19世紀スイスの哲学者カール・ヒルティはその「幸福論」の中で印象的なことをいっている。「まず何よりも肝心なのは、思い切ってやり始めることである。(中略)一度ペンをとって最初の一線を引くか、あるいは鍬を握って一打ちするかすれば、それでもう事柄はずっと容易になっているのである」。何かが足りなくて、準備ばかりするのが一番いけないのだ。私も、このような経験を何度もしている。「ともかくやり始めること」が大事なのである。この意味で、私は「モチベーション」という言葉が嫌いだ。モチベーションという言葉は、何かを始める前に、そのための精神状態が事前に必要であると思わせる。しかし、これは因果関係が逆である。前向きな精神は、ことを始めることによって生まれるからだ。やり始めることで次第に、集中が生まれるのである。熱が入ってくるのである。そして、道が見えてくる。そこに小さな一歩を進めることが、この「始める」の神髄である。当然、現実にはいろいろ制約がある。始めても小さなことかもしれない。>").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Passion やってみる'){
            
            $('.change_result1').text("<力を蓄え、次の伸びしろが見えたら全身全霊で飛び移る>").hide().fadeIn(5000).show();
            $('.change_result2').text("始めたことをより具体的な行動で示すのが「やってみる(Passion)」である。自信を持って行動することである。始めたことは、最初は小さい。しかし、始めてみると、そのうち、次にやるべきことが見えてくるものだ。そしてそれを愚直にやっていると、自分でも気がつかないうちに、あなたには力が蓄積されている。力が溜まっていく。そうしていると、思わぬところから、新たな機会がやってくることがある。実は、このときこそが大事だ。そのときこそ、これまで蓄えてきた力を使って、全身全霊で飛び移るときである。文字通り全身全霊で飛び移れ。迷ってはいけない。仲間もそこにいる。一緒に新たな道を拓こう。").hide().fadeIn(7000).show();

          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Curiosity 交わる'){
        
            $('.change_result1').text("<制約の中だからこそ、内なる原理に従う>").hide().fadeIn(5000).show();
            $('.change_result2').text("新たな行動を起こすとき、うまくいかないことも多いし、先が見えないことも多い。そこで焦りや迷いが生じることもある、このときにどうすべきか。これが「交わる(Curiosity)」であ。新たなことには自由がある。しかし、自由は、一方で人を苦しめる。あなたの前には来知の世界が拡がるからだ。既存のことの組合せだけでも、無限にある。この中に道を見つけていく必要がある。このような知らない世界、不確実な未来を前に前向きな態度を取るか、それとも、後ろ向きな態度を取るか。ここであなたは間われている。答えは常に1つだ。知らない未知の世界に前向きな態度を取るべきなのである。何が起きているかわからないという制約があるからこそ、あなたの内にある原理こそが前に進むために頼りになるのである。内なる原理を今こそ大事にしよう。").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Adventure 踏み出す'){
          
            $('.change_result1').text("<人が集まり、知恵が交わる機会を活かす>").hide().fadeIn(5000).show();
            $('.change_result2').text("踏み出すときがきた。未知に向かって、自分の意志で敢えて進もう。これこそが「踏み出す(Adventure)」である。世界は未知なだけではない。複雑である。こちらを押せば、あちらに影響が出る。互いに引き合う因果の網、広大なネットワークが目の前に拡がる。すべては見えない。しかし、すべてを感じることはできる。あなたには、今それができる。信じて進もう。人が集まり、知恵が交わる場に、不安を感じるときもある。それを機会に変える。その覚悟で行動できるかが問われているのである。未知で複雑な因果のネットワークが目の前に拡がる中でも、状況を前向きに機会に変えよう。").hide().fadeIn(7000).show();

          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Trust 信頼する'){
          
            $('.change_result1').text("<旅の落ちつかなさを楽しむ>").hide().fadeIn(5000).show();
            $('.change_result2').text("変化に向き合うとき、我々は慣れない分野やなじみのない人と交わらなければいけない。まわりの反応が読めず、落ち着かないし、不安を感じることもある。ここで問われることが、「信頼する(Trust)」である。他者との関係の基本は信頼である。予測不能な変化の中にあっても、この信頼こそが、人との関係の基本である。それは、既に持っている信頼できる関係だけの問題ではない、新たな人を信頼できるかが問われるのである。身体の動きで会話を盛り上げることができるかが、幸せと信頼の基本である。これは気の合う仲間と談笑したり、飲み会をしているときには、誰しもが自然に行っていることである。しかしあなたは、それを誰かに与えられるのを待ってはいけない。自らのまわりに生み出そう。").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Update 教わる'){
        
            $('.change_result1').text("<心を開いて、異質な事物と交わる>").hide().fadeIn(5000).show();
            $('.change_result2').text("変化に立ち向かうべく進むとき、必然的に「自分が知らないこと」が必要になる。どんな向き合い方をすればよいのか。これが「教わる(Update)」である。自分が知らないことが必要になったときに、あなたには2つの道がある。1つ目は、知っている範囲の中に活動を制限することである。2つ目は、知らないことを学び、自分の範囲を拡大することである。変化に向き合うときに選ぶべきは、常に第2の道である。謙虚に人に教わることである。我々は、常に人から学び、教わる気持ちで、人と向かい合うべきである。人に教わることで、答えの見えなかった問題へのヒントやアプローチが見えて来る。これこそが、人とのよい関係の至福である。そして、何よりも大事なのは、人からの新たな刺激に、心を開いて交わることである。「自分の知恵が人に伝わるのは、心を開いてその人と語り合う時だ。心を開いて、人を信じてお互いに語り合うところに、火花のように散る知恵が、本当に生きた知恵だ」、この火花が起きるためには、心を開くことが必要だ。そこで生まれる本当に生きた知恵からいつも教わる準備ができていること。").hide().fadeIn(7000).show();

          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Diversity 心を開く'){
          
            $('.change_result1').text("<積極的な意味で、一旦引く>").hide().fadeIn(5000).show();
            $('.change_result2').text("新たな関係は、あなたの意志から始まったものではないかもしれない。誰かに依頼されたものだったり、立場上その場に出ているだけかもしれない。それは相手も一緒だ。ここで問われるのが、この機会にどう向き合うか。これこそが、「心開く(Diversity)」である。多様なバックグラウンドの人たちが集まることを否定する人は今、少ない。ダイバーシティの重要性は既に広く論じられている。しかし、もっと大事なことがある。多様な背景や専門分野の人たちが集まれば集まるほど、新たな関係が思うようにいかない可能性が高まるということである。背景の違う人たちと交わるというのは、未知の世界と交わることである。もちろん、うまくいかないことも起こる。このときには、一旦引くことも大事だ。それこそが「心開く」ことのポイントである。").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Synergy 感謝する'){
          
              $('.change_result1').text("<成長のための困難に感謝し、立ち向かう>").hide().fadeIn(5000).show();
              $('.change_result2').text("常に心を開き、あらゆる機会を捉えて教わり、多様な人と新たな知恵を生むというのは、実は決して楽ではない。その困難や食い違いにどんな態度で向き合うか。そこにこそがあなたが試されているところである。そこで困難や食い違いや複雑な状況に「感謝する(Synergy)」ことができるか。ダイバーシティが大事という。多様な背景の人や分野を掛け合わせてシナジーを生むことが事といわれる。それが簡単なら、そんなことを敢えていう必要もない。実際には、簡単ではないし、大いなる困難をともなう。その困難に感謝し、挑戦できるだろうか。それができるかどうかで、その先の果実が得られるかが決まる。敢えて困難に感謝し立ち向かうことこそ、動的な意味で「幸せ」である。").hide().fadeIn(7000).show();

          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Relationship 結束する'){
          
              $('.change_result1').text("<心配し、そして笑い飛ばす>").hide().fadeIn(5000).show();
              $('.change_result2').text("人と共鳴しあうためには、まず身近な人たちと、よい関係を築くことである。これを「結束する(Relationship)」と呼ぶ。チームの仲間とよい関係を築くことの重要性は疑いない。よいチームは生産的で創造的で、そして互いに助け合うことによって、一人ではできないことを可能にする。しかし、予測不能な変化は、この結束に揺さぶりをかける。うまくいっていたやり方を見直さなければならなくなる。新たなルールや資源も必要になる。だから、あなたは心配になる。といって、あらかじめ心配して準備すると、意外に結果としては、大事にいたらず、後からは笑い飛ばせるようになる。これこそが「結束する」の至福であり、この境地にいたることこそ、動的な意味で「幸せ」である。").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Partnership 協調する'){
          
              $('.change_result1').text("<活躍できる状況に我欲を越えた行動を貫く>").hide().fadeIn(5000).show();
              $('.change_result2').text("新たな協力関係が動き始めたときにこそ、気をつけるべきことがある。それは何か。これを「協調する(Partnership)」と呼ぶ。新たな人と助け合い、協力をしあうというのは、実は口でいうほど簡単ではない。その場に集まることになった人は、集まった目的について納得していないものである。出身母体が異なったり、専門性が異なったりすると、個人ごとに参画する目的意識は異なる場合が多い。だからこそ、違いを認めて、共通の目的に導く必要がある。このためにまずは、リーダーが我欲を捨て、共通の目的のための行動や発言を貫く必要がある。異なる文化や専門性が集まっているからこそ、単なる足し算を超えた新たなものこができる。").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] === 'Inclusion 対等になる'){
            
              $('.change_result1').text("<制約には従い、工夫する>").hide().fadeIn(5000).show();
              $('.change_result2').text("一見、人との協力が進んでいる。そのときこそ、意識すべきことがある。それが「対等になる(Inclusion)」。新たな人との関係をつくるときには、先の見通しが立たない場合が多い。やってみないと相手の反応や相手ができることがわからない。しかも、人との関係維持に時間とエネルギーを使う。従って、忙しい日常の中で、新たな人との関係づくりは面倒に思われるものだ。実は、新たなつながりをつくるという「面倒なこと」を行うのには、コツがある。それは「面倒だから、やろう」という言葉である。理屈を超えた思い切りが必要なのである。迷わず、行動するのである。あなたが、従来の関係を超えて、異なる背景の人たちとかみ合うためには、現実という制約を認め、従い、工夫することが必要である。これができてこそ、新たな人のつながりを敢えてつくることができる。").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");

          } else if (aryList[random] ==='Resonance 協創する'){
          
              $('.change_result1').text("<緊張する状況でもぶれずに前に進む>").hide().fadeIn(5000).show();
              $('.change_result2').text("新たな関係が進むとき、忘れてはならないことがある。これを「協創する(Resonance)」という。これはただ仲良くするというのではない。実は、もっと厳しいものである。以下の4つの落とし穴に落ちないようにしなければいけない。まず、もともと異なる背景を持った人たちが集まり、力を合わせ、一人ではできないことがきるようになることは素晴らしいことである。しかし、そこで止まってはいけない。第１に気をつけるべきは、共感しても、迎合してはならないことである。これを孔子は「和して同ぜず」と呼び、「易」では同じく孔子は「和してよろこぶ」という。それでこそ、新たな機会を活かすことにつながるのである。共感が、迎合につながるとき、新たなものが生まれる可能性が失われる。その上で、一緒にコトを起こすのである。ただし、このときにも大事なことがある。第2に、うまくいけばいくほど、山を越えるときには、人としての「まこと」を忘れてはならないということである。我々には自然の我欲がある。これにとらわれてはいけない。うまくっているときほどそうである。まさに、今越えようとしている山は、一人で越えたのではない。しかも、あなたがうまくいったことで、むしろ困っている人もいるかもしれない。越えなければいけないときは来る。ここでどんな態度を取るか。ここにあなたの人徳が出る。もちろん、大きなことを起こすには、緊張する状況も避けられない。協創する仲間の中から、状況が緊迫する中で、怖じ気づく人も出てくるかもしれない。あなた自身も、本当にこの道でよいのか、迷う瞬間もあろう。第3の留意点は、だからこそ、緊張する状況でも、ぶれずに進め、ということである。そして、うまくいっているときこそが、最も危ない。我々の自尊心や安易な心が顔を出すからだ。だから、そういうときこそ、自らをいつも以上に省みる必要がある。これが第4の留意点である。").hide().fadeIn(7000).show();
            
          //   $('#rand_pic').attr("src","image/peaper.png");
          }

      });

    //回転を再開する
    $('.restart').click(function(){
        $('.change_result1').hide();
        $('.change_result2').hide(); //再開ボタンの非表示
        $(this).hide(); 
        $('.stop').show(); //止めるボタンの表示
    
        randStart = setInterval(randShuffle, speed); //シャッフル再開

        // $('#rand_pic').attr("src","image/jan1.png");
        
    });
    
    
      

});

// // document.addEventListener('click', audioPlay);
// function audioPlay() {
//   document.getElementById('audio').play();
 
// }

$('#startButton') .click(function(){
  $('#audio').get(0).play();
});

$('#stopButton') .click(function(){
  $('#audio').get(0).pause();


});

$('#stopButton') .click(function(){
 
  $('#audio2').get(0).play();
  

});


$('#restartButton') .click(function(){
  $('#audio').get(0).play();
});

function playAudioLoop() {
  //ループ再生ON
  audio.loop = true;

  //再生
  audio.play();
}



// ////////////////////////////////////////////////////////////////////
